package data

data class Student (
    val surname: String,
    val firstname: String,
    val patronymic: String,
    val id: Int,
    val id_group: Int
){
    override fun toString(): String =
        "$surname $firstname $patronymic"
}


fun studentsList() =
    arrayListOf(
        Student("Петров", "Петр", "Петрович", 1, 2),
        Student("Петрова", "Инна", "Петрович", 2, 2),
        Student("Иванов", "Иван", "Иванович", 3, 2),
        Student("Потапенко", "Геннадий", "Викторович", 4, 2),
        Student("Хрущова", "Галина", "Николаевна", 5, 2),
        Student("Коши", "Артур", "Петрович", 6, 3),
        Student("Жолова", "Лидия", "Петровна", 7, 3),
        Student("Менделеева", "Людмила", "Никитовна", 8, 3),

        Student("Бейсембаев", "Имир", "Амангельдыевич", 9, 1),
        Student("Буйволова", "Екатерина", "Игоревна", 10, 1),
        Student("Воробьев", "Данила", "Владимирович", 11, 1),
        Student("Гвоздеев", "Максим", "Алексеевич", 12, 1),
        Student("Дёмина", "Анастасия", "Николаевна", 13, 1),
        Student("Жараспаева", "Джанна", "Салимжановна", 14, 1),
        Student("Жестовский", "Ян", "Сергеевич", 15, 1),
        Student("Кончиц", "Артём", "Михайлович", 16, 1),
        Student("Купряков", "Даниил", "Витальевич", 17, 1),
        Student("Носова", "Анна", "Олеговна", 18, 1),
        Student("Пляшкевич", "Антон", "Константинович", 19, 1),
        Student("Садуова", "Нургуль", "Нурситовна", 20, 1),
        Student("Сексембаев", "Тимур", "Кобергенович", 21, 1),
        Student("Султанов", "Алмат", "Алексеевич", 22, 1),
        Student("Цыганкова", "Юлия", "Александровна", 23, 1),
        Student("Дербенев", "Александр", "Сергеевич", 24, 1),
        Student("Труников", "Виталий", "Сергеевич", 25, 1),
        Student("Карстен", "Алексей", "Максимович", 26, 1)
    )